function TheEnd(){
    return(
        <div>
            <p id="endtitle">UKRAINIAN PHOTODOCUMENTARY</p>
            <script src="author.js" type="text/babel"></script>

        </div>
    )
}

function Contact(){
    return(
        <div>
        <a name="libkoscontact" id="titlecontact">Контакти</a>
        
        <ul type="squere" className="list">
            <li>Instagram: <a id="link" href="https://instagram.com/libkos?igshid=MjkzY2Y1YTY="> @libkos</a></li>
            <li>Telegram: <a id="link" href="t.me/libkosstories (https://t.me/libkosstories)">LIBKOS STORIES</a></li>
            <li>Підтримка libkos: <a id="link" href="https://send.monobank.ua/jar/sVU9eHExu">bank monobank</a></li>
            <li>PayPal:  libkos@gmail.com</li>
        </ul>
        </div>
    )
}


function Text(){
    return(
        <div>
        <hr color=""></hr>
        <a name="1" id="pointtext1">Початок кар’єри</a>
        
        <pre className="text1">До повномасштабного вторгнення ми знімали в основному лавсторі, дуже рідко — весілля. Знімати історії про  кохання було цікаво, замовлень вистачало. Певної миті ми досягли високого професійного рівня і почали навчати  інших фотографів. Але весільна сфера здавалася монотонною. Ми називали себе весільними фотографами для зручності,  аби довго не пояснювати замовникам і колегам, що у нас є  й інші проєкти. Після повномасштабного вторгнення ми вирішили фіксувати війну в Одесі:  знімали вулиці, прощання на вокзалах. Чим більше займалися документалістикою, тим більше вона нас затягувала. Тепер ми розуміємо, що документальна фотографія — це справжня фотографія.</pre>
        
        <a name="2" id="pointtext2">Помилки та критика</a>
        <pre className="text2">Основне наше завдання — зняти героїв правдиво, коректно передаючи їхні емоції. Людина, яка переживає біль, відчай чи щастя, не завжди виглядає красиво. У цьому полягає ще одна відмінність від нашої попередньої роботи: фотографуючи зараз, ми не думаємо про те, як виглядає герой світлини.
            <br />Аби знімати естетично, потрібно робити компліментарні зображення і ретельно обирати об’єкти. Воєнна фотографія не про це, але ми дійшли такого висновку не одразу.
            <br />Навесні ми знімали звільнену від російських військ Київщину. Ми робили акцент на геройстві українців, забувши про страшні аспекти війни — смерті, горе, руйнування. У результаті російські пропагандисти використали наші роботи у своїх цілях. Мовляв, подивіться, ось фото з Ірпеня, мертвих тіл немає, отже, інші знімки — постановка.
            <br />Нас критикували й за військову форму. Було так. Ми приїхали на лінію фронту у цивільному, тому військові запропонували переодягтися у щось більш зручне — якийсь камуфляж із магазину для риболовлі та полювання. Ми так і зробили. Потім іноземні журналісти сказали, що фотограф не має права носити форму. Світлини, на яких ми були в ній, багатьох образили — дехто, можливо, подумав, що ми носимо піксель (це не так). Шкода, що так трапилося. Ми в жодному разі не хотіли виділитися чи хизуватися тим, що порушуємо правила. Ми просто не знали, що камуфляж — табу. Тепер знаємо. Ми вчимося.</pre>
        <a name="3" id="pointtext3">Робота під обстрілами</a>
        <pre className="text3">На початку військові нам не довіряли: ми не мали стосунку ні до журналістики, ні до документальної фотографії. Зараз вони самі іноді запрошують нас на позиції.
            <br />Ми працюємо вдвох, аби мати два різних погляди на те, що відбувається. На передку у нас щільний графік. Прокидаємося о шостій ранку, зустрічаємося з військовими, вони ведуть нас на позиції. Знімаємо до вечора, потім повертаємося у готель відібрати та обробити фото. Намагаємося підготувати світлини того ж дня, зранку часу на них не буде. І так по колу.
            <br />Отримання дозволу на зйомку займає багато часу, але ми завжди працюємо офіційно, все узгоджуємо і не публікуємо знімки, за якими можна ідентифікувати локацію.
            <br />Ми довго знімали на Сході, з початку січня працюємо у Херсонській області. Хочемо показати, як живе місто під постійними обстрілами. Коли ми приїхали до Бахмута влітку, нам було страшно, але потім ми звикли до обстрілів. Людина до всього адаптується, а робота примушує забути про страх. А ось до того, як війна радикально змінює життя, створюючи разючі контрасти, звикнути неможливо. Уявіть: у Соледарі люди місяцями живуть у підвалах, а всього за 60 кілометрів від міста, у Краматорську, можна спокійно посидіти в кафе або замовити суші.</pre>
        <a name="4" id="pointtext4">Професія після війни</a>
        <pre className="text4">Наші світлини, що «залетіли» в інстаграмі або були куплені великими медіа, як правило, пов’язані з горем і болем, свідками якого ми стали. Зараз у нас немає часу на рефлексію та вибір знімків, які ми вважаємо значущими. Ми займемося цим після війни, коли переглянемо архіви.
            <br />Дивлячись на роботу колег, ми розуміємо, що нам є куди рости. Але вони документують війну вісім років, а ми почали нещодавно, тож працюємо, докладаючи всіх зусиль.
            <br />Можливо, після перемоги ми займемося портретами, але до весільної тематики не повернемося. Аби знімати кохання, фотограф має перебувати у певному емоційному стані, а у нас стався надлом. До того ж, коли ти почав займатися документалістикою, вороття немає.</pre>
    </div>

    )
}


function Title(){
    return(
        <div>
          <p id="nameauthor">KOSTIANTYN & VLADA</p>
          <p id="nameauthor2">LIBEROV</p>
          <img className="author1" src="../photo/photo22.jpg" />
          <img className="author2" src="../photo/photo24.jpg" />
          <img className="author3" src="../photo/photo25.jpg" />
          <img className="author4" src="../photo/photo20.jpg" />

        </div>
    )
}

function TitleHead(){
    return(
        <div id="header">
            <div className="header">
                <div className="headlogo">
                    <img className="logo" src="../photo/photo1.jpg" />
                    <b className="namelogo"><big>libkos</big></b>
                </div>
                <div className="headbotton">
                    <a href="../libkos/libkos.php">Головна сторінка</a>
                    <a href="libkosauthor.php">Про авторів</a>
                    <a href="../portfolio/libkosportfolio.php">Портфоліо</a>
                    <a href="#libkoscontact">Контакти</a>
                </div>
            </div>
        </div>
        
    )
}

function Conect(){
    return(
        <div>
        <p id="content">Зміст</p>
        <ol start="1" id="contentdetails">
            <li><a href="#1">Початок кар’єри</a></li>
            <li><a href="#2">Помилки та критика</a></li>
            <li><a href="#3">Робота під обстрілами</a></li>
            <li><a href="#4">Професія після війни</a></li>
        </ol>
    </div>

    )
}



function Main() {
    return( 
        <div>
            <TitleHead />
            <Conect />
            <Title />
            <Text />
            <Contact />
            <TheEnd />
        </div>       
    )
}



const app = document.getElementById("head_main");
ReactDOM.render(<Main />, app);